Repository: TuXimo/CV_Blazor
Catalog: CV_Blazor/Resources/Resources.*.resx
Languages: es_es

# ab_DownloadCV
source: Download CV
es_es: Descargar Currículum

# ab_Projects
source: See my projects
es_es: Ver mis proyectos

# ab_Title
source: Hello, my name is Maximo
es_es: Hola, soy Máximo

# cs_contactInformation
source: Contact Information
es_es: Datos de Contacto

# nav_AboutMe
source: About Me
es_es: Sobre mí

# nav_Contact
source: Contact
es_es: Contacto

# nav_DarkMode
source: Dark Mode
es_es: Modo oscuro

# nav_Projects
source: Projects
es_es: Proyectos

# nav_Resume
source: Resume
es_es: Resumen

# nav_Skills
source: Skills
es_es: Habilidades

# rs_xp
source: Professional Experience
es_es: Experiencia Profesional

# rs_education
source: Education
es_es: Educación

# ss_levelLabel
source: Level
es_es: Nivel

# ps_myProjects
source: My projects
es_es: Mis proyectos

# cs_contactMe
source: You can contact me:
es_es: Me podés contactar por:

# ps_seeProject
source: See project
es_es: Ver proyecto

# ss_level1
source: Basic
es_es: Básico

# ss_level2
source: Novice
es_es: Principiante

# ss_level3
source: Intermediate
es_es: Intermedio

# ss_level4
source: Advanced
es_es: Avanzado

# ss_level5
source: Expert
es_es: Experto

# nav_Home
source: Home
es_es: Inicio

# ss_C#_Description
source: Solid experience in C# with a primary focus on video game development in the Unity engine. I have extensive knowledge of design patterns (such as Singleton, Observer, and Factory) and best practices. Additionally, I have worked with the .NET environment, including projects with ASP.NET and Blazor, which allows me to create web applications like this one.
es_es: Sólida experiencia en C# con un enfoque principal en el desarrollo de videojuegos en el motor Unity. Poseo un amplio conocimiento de patrones de diseño (como Singleton, Observer y Factory) y buenas prácticas. Además, he trabajado con el entorno .NET, incluyendo proyectos con ASP.NET y Blazor, lo que me permite crear aplicaciones web como esta.

# ss_Unity_Description
source: Programmer with experience in the Unity engine, focused on 3D game development. I excel in programming game mechanics, creating simulators, and implementing user interface (UI) systems. I am also familiar with asset integration and modification, and I have knowledge of ShaderLab for creating visual effects and optimizing performance for mobile platforms.
es_es: Programador con experiencia en el motor Unity, con un enfoque en el desarrollo de juegos 3D. Destaco en la programación de mecánicas de juego, la creación de simuladores y la implementación de sistemas de interfaz de usuario (UI). También me he familiarizado con la integración y modificación de assets, y poseo conocimientos de ShaderLab para la creación de efectos visuales y la optimización de rendimiento para plataformas móviles.

# ss_Unreal_Description
source: I have worked with the Unreal engine, focusing on creating 3D environments, including landscapes and platforms. I have experience in asset integration, prototyping virtual reality (VR) projects, and working with animations.
es_es: He trabajado con el motor Unreal, enfocándome en la creación de entornos 3D, incluyendo landscapes y plataformas. Tengo experiencia en la integración de assets, el prototipado de proyectos de realidad virtual (VR) y el trabajo con animaciones.

# ss_Blender_Description
source: I have modeled and textured in 3D using Blender, focusing on optimizing models with high polygon density and multiple materials. I have experience creating animations from scratch and integrating them directly into my video game projects.
es_es: He modelado y texturizado en 3D con Blender, con un enfoque en la optimización de modelos con alta densidad de polígonos y múltiples materiales. Poseo experiencia en la creación de animaciones desde cero,ándolas directamente en mis proyectos de videojuegos.

# ss_JS/TS_Description
source: I have knowledge of JavaScript and TypeScript, mainly applied in the development of interactive and web experiences. I have experience working with Needle Engine within Unity and with the Three.js library for 3D web projects. Additionally, I have basic experience in creating web pages.
es_es: Tengo conocimientos de JavaScript y TypeScript, principalmente aplicados en el desarrollo de experiencias interactivas y web. Poseo experiencia trabajando con Needle Engine dentro de Unity y con la biblioteca Three.js para proyectos 3D en la web. Además, tengo experiencia básica en la creación de páginas web.

# ss_Git_Description
source: I have experience using Git for both individual and team projects, demonstrating a solid understanding of version control workflows. I strategically use commits and tags as checkpoints to manage the code history. I have worked with platforms like GitHub and GitLab for collaboration and project deployment.
es_es: Tengo experiencia en el uso de Git tanto en proyectos individuales como en equipos, demostrando un sólido entendimiento del flujo de trabajo de control de versiones. Utilizo commits y tags de manera estratégica como puntos de control para la gestión del historial de código. He trabajado con plataformas como GitHub y GitLab para la colaboración y el despliegue de proyectos.

# ss_Photoshop_Description
source: Basic knowledge of Adobe Photoshop for image editing, resizing, and adaptation for different platforms. I have experience creating user interface (UI) elements, such as text, for implementation in projects.
es_es: Manejo básico de Adobe Photoshop para la edición de imágenes, redimensión y adaptación para diferentes plataformas. Poseo experiencia en la creación de elementos de interfaz de usuario (UI), como textos, para su implementación en proyectos.

# ps_summary_1
source: I am a software developer with experience in C# and Unity.
es_es: Soy desarrollador de software con experiencia en C# y Unity.

# ps_summary_2
source: I am passionate about creating innovative mechanics.
es_es: Me apasiona crear mecánicas innovadoras.

# ps_summary_3
source: I am looking to contribute to challenging projects.
es_es: Estoy buscando aportar en proyectos desafiantes.

# ps_exp_xowen_title
source: Animation Clean Up (Intern)
es_es: Clean Up de Animaciones - Pasantia

# ps_exp_xowen_ach_1
source: I performed the animation cleanup and optimization process in Unreal Engine to improve the movement fidelity and project efficiency.
es_es: Realicé el proceso de limpieza y optimización de animaciones (cleanup) en Unreal Engine para mejorar la fidelidad de los movimientos y la eficiencia del proyecto.

# ps_exp_xowen_ach_2
source: I collaborated in integrating animations into the game engine.
es_es: Colaboré en la integración de animaciones en el motor del juego.

# ps_exp_abi_rached_title
source: Unity Programmer
es_es: Programador de Unity

# ps_exp_abi_rached_ach_1
source: Developed and programmed gameplay mechanics and combat systems for a hack and slash style action role-playing game.
es_es: Desarrollo y programación de las mecánicas de jugabilidad y sistemas de combate para un videojuego de rol de acción estilo Hack and Slash.

# ps_exp_abi_rached_ach_2
source: Responsible for implementing animation systems and enemy logic in Unity.
es_es: Responsable de la implementación de sistemas de animación y lógica de enemigos en Unity.

# ps_edu_unimendoza_title
source: Technician in Video Game Development
es_es: Tecnicatura en Desarrollo de Videojuegos

# ps_tightrope_walker_desc
source: A mobile game developed in Unity, where the character's control is based on the device's gyroscope, simulating the balance of a tightrope walker.
es_es: Juego para móviles desarrollado en Unity, donde el control del personaje se basa en el giroscopio del dispositivo, simulando el equilibrio de un funambulista.

# ps_interactive_website_title
source: Interactive Personal Website
es_es: Página Web Interactiva

# ps_interactive_website_desc
source: An interactive resume hosted on www.3d.maximobrunetti.com.ar, developed with Needle Engine and Three.js to create an immersive experience.
es_es: Un currículum interactivo alojado en www.3d.maximobrunetti.com.ar, desarrollado con Needle Engine y Three.js para crear una experiencia inmersiva.

# ps_the_last_laugh_title
source: The Last Laugh
es_es: La Última Risa

# ps_the_last_laugh_desc
source: A game developed for the Global Game Jam 2024.
es_es: Juego desarrollado para la Global Game Jam 2024.

# ps_earthquake_simulator_title
source: Earthquake Simulator (University Project)
es_es: Simulador de Terremotos (Proyecto Universitario)

# ps_earthquake_simulator_desc
source: An academic simulator developed for the university, focused on simulating an earthquake and localized in several languages for a global audience.
es_es: Simulador académico desarrollado para la universidad, enfocado en simular un terremoto y localizado en varios idiomas para una audiencia global.

# ps_bitter_surprises_title
source: Bitter Surprises
es_es: Sorpresas Amargas

# ps_bitter_surprises_desc
source: A 2D psychological horror game developed in 3 days for a Game Jam.
es_es: Juego de horror psicológico en 2D desarrollado en 3 días para una Game Jam.
